/* Copyright (c) all rights reserved
*******************************************************************************
* @file    mcu_pwm.c
* @author  wangxq
* @version v1.0.1
* @date    2020-04-23
* @brief   
*******************************************************************************
* @attention
*
*
*
*******************************************************************************
*/
#include "mcu_pwm.h"
#include "struct.h"


/******************************************************************************
* name		: 
* function	:
******************************************************************************/
void MCU_PwmInit(void)
{
	TRISA7 = 1;
	PWMCON0 = 0b00000100;
	PWMTL = 128;
	PWMTH = 0x00;
	PWMD2L = adc.pwmDuty;
	PWMD23H = 0;
	TRISA7 = 0;
}
//

#if PWM2_EN
/******************************************************************************
* name		: 
* function	:
******************************************************************************/
void MCU_PWM2_SetDuty(u8 duty)
{
	PWM_IO_2 = PWM_IO_IN;
	if (duty > PWM0_3_PERIOD)
		duty = PWM0_3_PERIOD;
	PWMD2L = duty&0xFF;
//	PWMD23H &= (duty>>8); //B[1:0] //本项目只用到低8位，高8位是0
	PWM_IO_2 = PWM_IO_OUT;
}
//

#endif //PWM2_EN

